const csvText = "44.38,34.33,Алушта,31440,\n" +
    "49.46,30.17,Біла Церква,200131,\n" +
    "49.54,28.49,Бердичів,87575,\n" +
    "46.49,36.58,Бердянськ,121692,\n" +
    "49.15,28.41,Вінниця,356665,\n" +
    "#45.40,34.29,Джанкой,43343,\n" +
    "48.28,34.47,Камянське,255841,\n" +
    "48.31,35.08,Дніпро,1065008,\n" +
    "#48.03,37.47,Донецьк,1016194,\n" +
    "50.18,28.49,Житомир,284236,\n" +
    "49.04,28.12,Жмеринка,37349,\n" +
    "47.53,35.23,Запоріжжя,815256,\n" +
    "#\n" +
    "45.11,33.28,Євпаторія,105915,\n" +
    "48.56,24.53,Івано-Франківськ,218359,\n" +
    "48.43,26.45,Камянець-Подільський,99610,\n" +
    "#45.20,36.38,Керч,157007,\n" +
    "50.27,30.30,Київ,2611327,\n" +
    "48.31,32.21,Кропивницький,254103,\n" +
    "49.07,33.35,Кременчук,234073,\n" +
    "47.54,33.33,Кривий Ріг,668980,\n" +
    "#48.36,39.22,Луганськ,463097,\n" +
    "50.49,25.26,Луцьк,208816,\n" +
    "49.53,24.16,Львів,732818,\n" +
    "47.07,37.40,Маріуполь,492176,\n" +
    "46.53,35.25,Мелітополь,160657,\n" +
    "46.58,32.12,Миколаїв,514136,\n" +
    "#48.26,22.45,Мукачеве,82346,\n" +
    "47.37,34.30,Нікополь,136280,\n" +
    "46.29,30.44,Одеса,1029049,\n" +
    "48.33,35.57,Павлоград,118816,\n" +
    "49.37,34.37,Полтава,317998,\n" +
    "50.39,26.26,Рівне,248813,\n" +
    "49.33,23.23,Самбір,36556,\n" +
    "44.29,33.43,Севастополь,342451,\n" +
    "#44.55,34.13,Сімферополь,343644,\n" +
    "50.58,34.52,Суми,293141,\n" +
    "49.37,25.47,Тернопіль,227755,\n" +
    "48.40,22.30,Ужгород,117317,\n" +
    "50.05,30.03,Фастів,51976,\n" +
    "45.02,35.31,Феодосія,74669,\n" +
    "50.02,36.14,Харків,1470902,\n" +
    "46.40,32.42,Херсон,328360,\n" +
    "49.26,27.06,Хмельницький,253994,\n" +
    "48.11,23.40,Хуст,29080,\n" +
    "49.27,32.03,Черкаси,295414,\n" +
    "51.29,31.22,Чернігів,304994,\n" +
    "48.16,26.07,Чернівці,240621,\n" +
    "#44.26,34.19,Ялта,81654,"

function parseCSV(csvText) {
    let cities = csvText
        .split('\n')
        .filter(value => !value.startsWith('#'))
        .map((value) => {
            let tempArr = value.split(",");
            return {x: tempArr[0], y: tempArr[1], city: tempArr[2], population: tempArr[3]}
        })
        .sort((cityA, cityB) => cityB.population - cityA.population)
        .slice(0, 10)
        .reduce((prev, item, index) => {
            prev[item.city] = {population: item.population, rating: index + 1};
            return prev;
        }, {})
    return (text) => {
        let word = text.split(" ");
        word.filter(cityName => {
            if (cities[cityName]) text = text.replace(cityName, `${cityName} (${cities[cityName].rating} місце в ` +
                `ТОП-10 найбільших міст України, населення - ${cities[cityName].population} осіб)`);
        })
        return text;
    }
}

let modifyText = parseCSV(csvText);
let div = document.createElement('div')
let p = document.createElement('p')
let header = document.createElement('h2')
header.innerText = 'Modified text'
p.innerText = modifyText(document.getElementById('original').innerText)
div.appendChild(p)
document.body.appendChild(header)
document.body.appendChild(div)
